app/controllers/masters_controller.rb

    def show
        @master = Master.find(params[:id])
        @pokemon = Pokemon.find(@master[:pokemon_id])
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]