app/controllers/masters_controller.rb

  def index
    @masters = Master.all
---
SELECT "masters".* FROM "masters"

  def create
    @master = Master.new
    @master.name = params[:master][:name]
    @master.pokemon_id = params[:master][:pokemon_id]
    @master.save
---
INSERT INTO "masters" ("name", "pokemon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Arnaud"], ["pokemon_id", 6], ["created_at", "2018-07-18 14:41:21.957052"], ["updated_at", "2018-07-18 14:41:21.957052"]]

  def new

    @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def edit
    @master = Master.find( Integer(params[:id]) )
    @pokemons = Pokemon.all
---
SELECT  "masters".* FROM "masters" WHERE "masters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons"

  def show
    @master = Master.find( Integer(params[:id]) )
    @pokemon = Pokemon.find(@master.pokemon_id)
---
SELECT  "masters".* FROM "masters" WHERE "masters"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    master = Master.find( Integer(params[:id]) )
    master.update(pokemon_id: params[:master][:pokemon_id], name: params[:master][:name])
---
SELECT  "masters".* FROM "masters" WHERE "masters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "masters" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "masters"."id" = $3  [["pokemon_id", 9], ["updated_at", "2018-07-18 15:13:41.467600"], ["id", 1]]

  def destroy
    master = Master.find( Integer(params[:id]) )
    master.destroy
---
SELECT  "masters".* FROM "masters" WHERE "masters"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "masters" WHERE "masters"."id" = $1  [["id", 4]]