app/controllers/pokemon_controller.rb

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
---
    def show
      #  SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1
      @pokemon = Pokemon.find(params[:id])

INSERT INTO "pokemons" ("name", "img", "height", "weight", "candy", "candy_count", "egg", "avg_spawns", "spawn_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
      @pokemons = Pokemon.new(pokemon_params)

      @pokemons.save

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
UPDATE "pokemons" SET "name" = $1, "updated_at" = $2 WHERE "pokemons"."id" = $3  [["name", "Hello"], ["updated_at", "2018-07-17 17:34:37.554184"], ["id", 1]]
---
    def update
      @pokemon = Pokemon.find(params[:id])
      @pokemon.update(pokemon_params)

DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 1]]
---
    def destroy
      @pokemon = Pokemon.find(params[:id])

      @pokemon.destroy