app/controllers/pokemons_controller.rb

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 152], ["LIMIT", 1]]
---
  def show
    @pokemon = Pokemon.find( Integer(params[:id]) )

INSERT INTO "pokemons" ("name", "img", "height", "weight", "candy", "egg", "spawn_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."name" = $1 LIMIT $2  [["name", "hal"], ["LIMIT", 1]]
UPDATE "pokemons" SET "num" = $1, "updated_at" = $2 WHERE "pokemons"."id" = $3  [["num", "152"], ["updated_at", "2018-07-18 15:58:16.594226"], ["id", 152]]
---
  def create
    Pokemon.create(name: params[:pokemon][:name], img: params[:pokemon][:img], height: params[:pokemon][:height], weight: params[:pokemon][:weight], candy: params[:pokemon][:candy], candy_count: params[:pokemon][:candy_count], egg: params[:pokemon][:egg], avg_spawns: params[:pokemon][:avg_spawns], spawn_time: params[:pokemon][:spawn_time])
    new_pokemon = Pokemon.find_by( name: params[:pokemon][:name] )
    new_pokemon.update_attribute(:num, new_pokemon.id.to_s)

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @pokemon = Pokemon.find(Integer(params[:id]))

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pokemons" SET "name" = $1, "updated_at" = $2 WHERE "pokemons"."id" = $3  [["name", "Bulbasaros"], ["updated_at", "2018-07-18 15:58:40.674439"], ["id", 1]]
---
  def update
    pokemon = Pokemon.find(Integer(params[:id]))
    pokemon.update(name: params[:pokemon][:name], img: params[:pokemon][:img], height: params[:pokemon][:height], weight: params[:pokemon][:weight], candy: params[:pokemon][:candy], candy_count: params[:pokemon][:candy_count], egg: params[:pokemon][:egg], avg_spawns: params[:pokemon][:avg_spawns], spawn_time: params[:pokemon][:spawn_time])

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 123]]
---
  def destroy
    pokemon = Pokemon.find(Integer(params[:id]))
    pokemon.destroy